cask_args appdir: '/Applications'

# Tap repositories
tap 'heroku/brew'

# Brew services
brew "git"
brew "heroku"
brew "nvm"
brew "openssl"
brew "postgresql", restart_service: true
brew "rbenv"
brew "rbenv-default-gems"
brew "readline", link: true
brew "redis", restart_service: true
brew "ruby-build"
brew "ssh-copy-id"
brew "watch"
brew "yarn"
brew "z"

# Cask applications
cask "chromedriver"
cask "google-chrome"
cask "graphiql"
cask "iterm2"
cask "postman"
cask "slack"
cask "visual-studio-code"
cask "zoomus"